prst/TM4C1294/blinky.c
//*****************************************************************************
//
// blinky.c - Simple example to blink the on-board LED.
//
// This is start code of the EK-TM4C1294XL.
//
//*****************************************************************************

#include <stdlib.h>
#include <stdint.h>
#include "inc/tm4c1294ncpdt.h"

#include <stdbool.h>
#include <stdint.h>
#include "inc/hw_memmap.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "driverlib/pwm.h"
#include "driverlib/sysctl.h"
#include "driverlib/uart.h"
#include "utils/uartstdio.h"

//#include "inc/hw_types.h"
//#include "drivers/pinout.h"
//#include "driverlib/rom.h"
//#include "driverlib/rom_map.h"

//typedef  enum { FALSE, TRUE } bool;


//*****************************************************************************
//! \addtogroup example_list
//! <h1>Blinky (blinky)</h1>
//! A very simple example that blinks the on-board LED using direct register
//! access.
//*****************************************************************************



//******************************************************************************
//#define _LEDS_POS_I_SET   ( GPIO_PORTA_AHB_DATA_R |=  (1<<2) ) // Anod (Common) 4
//#define _LEDS_POS_I_CLR   ( GPIO_PORTA_AHB_DATA_R &= ~(1<<2) ) // Anod (Common) 4
#define _LEDS_POS_I_SET   ( GPIO_PORTQ_DATA_R |=  (1<<3) ) // Anod (Common) 4
#define _LEDS_POS_I_CLR   ( GPIO_PORTQ_DATA_R &= ~(1<<3) ) // Anod (Common) 4
#define _LEDS_POS_II_SET  ( GPIO_PORTP_DATA_R |=  (1<<3) )     // Anod (Common) 1
#define _LEDS_POS_II_CLR  ( GPIO_PORTP_DATA_R &= ~(1<<3) )     // Anod (Common) 1
#define _LEDS_POS_III_SET ( GPIO_PORTQ_DATA_R |=  (1<<1) )     // Anod (Common) 2
#define _LEDS_POS_III_CLR ( GPIO_PORTQ_DATA_R &= ~(1<<1) )     // Anod (Common) 2
//#define _LEDS_POS_IV_SET  ( GPIO_PORTA_AHB_DATA_R |=  (1<<3) ) // Anod (Common) 3
//#define _LEDS_POS_IV_CLR  ( GPIO_PORTA_AHB_DATA_R &= ~(1<<3) ) // Anod (Common) 3
#define _LEDS_POS_IV_SET  ( GPIO_PORTQ_DATA_R |=  (1<<2) ) // Anod (Common) 3
#define _LEDS_POS_IV_CLR  ( GPIO_PORTQ_DATA_R &= ~(1<<2) ) // Anod (Common) 3
#define _LEDS_POS_V_SET   ( GPIO_PORTM_DATA_R |=  (1<<6) )     // Anod (Common) 0
#define _LEDS_POS_V_CLR   ( GPIO_PORTM_DATA_R &= ~(1<<6) )     // Anod (Common) 0
//******************************************************************************
#define  BTN_PCS_0  (1)
#define  BTN_PCS_1  (2)
//******************************************************************************
#define  error_forever_loop   for(;;){}
//******************************************************************************


// LEDS[0,1,2,3]=[PN1,PN0,PF4,PF0]
// USER_SWITCH[0,1]=[PJ0,PJ1]

//******************************************************************************
// TYPES
//******************************************************************************
typedef enum {
	_TIMER_READY     = 0,
	_TIMER_NOT_READY = 1
} t_timer_stat;

/* Discriptor of timer settings */
typedef struct {
	uint8_t    ready_to_use   :1;
	uint8_t    timer_is_set   :1;
	uint32_t   set_timer_limit;
	uint32_t   cur_timer_val;
	uint32_t  *common_rule;
} t_Scheduler;

/* Discriptor of I/O */
typedef struct {
	float    in;
	uint8_t  x;
	uint8_t  y;
} t_io_values;

/* Discriptor of zmeyka */
typedef struct {
	uint8_t   *body;
	uint8_t   *ptr_field;
	uint8_t   *ptr_field_eat;
	uint32_t  len       :4;  // Lenght
	uint32_t  direction :2;  // 0:Up, 1:Down, 2:Left, 3:Right
	uint32_t  blinkhead :2;  // Blinking state for head of Snake
	uint32_t  curr_x    :3;  // Current position of head, axis X
	uint32_t  curr_y    :4;  // Current position of head, axis X
	uint32_t  next_x    :3;  // Calculated next position of head, axis X
	uint32_t  next_y    :4;  // Calculated next position of head, axis X
	uint32_t  algo_step :4;  // Algorithm step
	uint32_t  rezerv    :6;  // ...
	uint32_t  rnd;           // Random value
} t_io_Snake;

typedef enum {
	RC_OK = 0,
	RC_PTR_FAIL,
	RC_FAILED
} t_ret_code;

typedef enum {
	S_INIT = 0,
	S_START_RANDOM,
	S_BEGIN,
	S_MOVE,
	S_EAT_YES,
	S_EAT_NO,
	S_RANDOM,
	S_CHANGE_DIRECTION,
	S_BORDER_END
} t_algo_step;

//******************************************************************************



//******************************************************************************
// Global and system variables
//******************************************************************************
t_Scheduler timer_leds5x8;
t_Scheduler timer_leds1on, timer_leds1off;
t_Scheduler timer_leds2on, timer_leds2off;
t_Scheduler timer_leds3on, timer_leds3off;
t_Scheduler timer_leds4on, timer_leds4off;
t_Scheduler timer_count;
t_Scheduler timer_keys_usr1_2;

uint32_t  dly1 = 0;
uint32_t  dly2 = 0;
uint32_t  dly3 = 0;
uint32_t  dly4 = 0;
uint32_t  leds_position;

uint8_t   a_field [8][16];
uint8_t   a_field_eat [8][16];
uint8_t   data [5] = { 1,  3,  5,  7,  9 };
uint8_t   datas[5] = {'1','3','5','7','9'};

//******************************************************************************



//******************************************************************************
void  drv_sys_init_gpio ( void );
void  drv_usr_init_led_7segments ( void );
void  drv_usr_init_led_8x8 ( void );
void  drv_led_7segments_position (unsigned char pos);
void  drv_led_7segments_symbol ( uint8_t position, uint8_t symbol, uint8_t comma );
int   drv_led_blink (void);
void  drv_usr_init_scheduler_and_all_timers (void);
t_timer_stat delay_timer_count (uint8_t cfg);
t_timer_stat delay_timer_leds5x8 (uint8_t cfg);
char *IntToStr(int i, char b[]);
char *FloatToLeds5x8(float ff, char b[]);
char *ultostr(unsigned long value, char *ptr, int base);
char *ftostr(float value, char *p_string, int base, uint8_t *p_comma);
void  scan_keys ( t_io_values *p_io );
t_ret_code algo_Snake ( t_io_values *p_io,  t_io_Snake *p_snake );
//******************************************************************************



