prst/TM4C1294/blinky.c
	GPIO_PORTC_AHB_DATA_R |=  (1<<4); // Cathod - X0
	GPIO_PORTC_AHB_DATA_R |=  (1<<5); // Cathod - X1
	GPIO_PORTC_AHB_DATA_R |=  (1<<6); // Cathod - X2
	GPIO_PORTE_AHB_DATA_R |=  (1<<5); // Cathod - X3
	GPIO_PORTE_AHB_DATA_R |=  (1<<0); // Cathod - X4
	GPIO_PORTE_AHB_DATA_R |=  (1<<1); // Cathod - X5
	GPIO_PORTE_AHB_DATA_R |=  (1<<2); // Cathod - X6
	GPIO_PORTE_AHB_DATA_R |=  (1<<3); // Cathod - x7

	switch ( x ) {
		case 0: GPIO_PORTC_AHB_DATA_R &= ~(1<<4); break; // Cathod - X0
		case 1: GPIO_PORTC_AHB_DATA_R &= ~(1<<5); break; // Cathod - X1
		case 2: GPIO_PORTC_AHB_DATA_R &= ~(1<<6); break; // Cathod - X2
		case 3: GPIO_PORTE_AHB_DATA_R &= ~(1<<5); break; // Cathod - X3
		case 4: GPIO_PORTE_AHB_DATA_R &= ~(1<<0); break; // Cathod - X3
		case 5: GPIO_PORTE_AHB_DATA_R &= ~(1<<1); break; // Cathod - X3
		case 6: GPIO_PORTE_AHB_DATA_R &= ~(1<<2); break; // Cathod - X5
		case 7:	GPIO_PORTE_AHB_DATA_R &= ~(1<<3); break; // Cathod - X6
	}


	GPIO_PORTM_DATA_R     &= ~(1<<4); // Cathod - y0
	GPIO_PORTA_AHB_DATA_R &= ~(1<<6); // Cathod - y1
	GPIO_PORTD_AHB_DATA_R &= ~(1<<3); // Cathod - y2
	GPIO_PORTB_AHB_DATA_R &= ~(1<<2); // Cathod - y3
	GPIO_PORTB_AHB_DATA_R &= ~(1<<3); // Cathod - y4
	GPIO_PORTC_AHB_DATA_R &= ~(1<<7); // Cathod - y5
	GPIO_PORTE_AHB_DATA_R &= ~(1<<4); // Cathod - y6
	GPIO_PORTD_AHB_DATA_R &= ~(1<<7); // Cathod - X7
	GPIO_PORTD_AHB_DATA_R &= ~(1<<1); // Cathod - y8
	GPIO_PORTP_DATA_R     &= ~(1<<2); // Cathod - y9
	GPIO_PORTD_AHB_DATA_R &= ~(1<<0); // Cathod - y10
	GPIO_PORTM_DATA_R     &= ~(1<<3); // Cathod - y11
	GPIO_PORTH_AHB_DATA_R &= ~(1<<2); // Cathod - y12
	GPIO_PORTH_AHB_DATA_R &= ~(1<<3); // Cathod - y13
	GPIO_PORTN_DATA_R     &= ~(1<<2); // Cathod - y14
	GPIO_PORTN_DATA_R     &= ~(1<<3); // Cathod - X15

	switch ( y ) {
		case 0x00: GPIO_PORTM_DATA_R     |=  (1<<4); break; // Cathod - y0
		case 0x01: GPIO_PORTA_AHB_DATA_R |=  (1<<6); break; // Cathod - y1
		case 0x02: GPIO_PORTD_AHB_DATA_R |=  (1<<3); break; // Cathod - y2
		case 0x03: GPIO_PORTB_AHB_DATA_R |=  (1<<2); break; // Cathod - y3
		case 0x04: GPIO_PORTB_AHB_DATA_R |=  (1<<3); break; // Cathod - y4
		case 0x05: GPIO_PORTC_AHB_DATA_R |=  (1<<7); break; // Cathod - y5
		case 0x06: GPIO_PORTE_AHB_DATA_R |=  (1<<4); break; // Cathod - y6
		case 0x07: GPIO_PORTD_AHB_DATA_R |=  (1<<7); break; // Cathod - X7

		case 0x08: GPIO_PORTD_AHB_DATA_R |=  (1<<1); break; // Cathod - y8
		case 0x09: GPIO_PORTP_DATA_R     |=  (1<<2); break; // Cathod - y9
		case 0x0a: GPIO_PORTD_AHB_DATA_R |=  (1<<0); break; // Cathod - y10
		case 0x0b: GPIO_PORTM_DATA_R     |=  (1<<3); break; // Cathod - y11
		case 0x0c: GPIO_PORTH_AHB_DATA_R |=  (1<<2); break; // Cathod - y12
		case 0x0d: GPIO_PORTH_AHB_DATA_R |=  (1<<3); break; // Cathod - y13
		case 0x0e: GPIO_PORTN_DATA_R     |=  (1<<2); break; // Cathod - y14
		case 0x0f: GPIO_PORTN_DATA_R     |=  (1<<3); break; // Cathod - X15
	}
}
//******************************************************************************



//******************************************************************************
// LEDS[0,1,2,3]=[PN1,PN0,PF4,PF0]
//******************************************************************************
int drv_led_blink (void) {
    volatile uint32_t ui32Loop;
    //.........................................................................
    if (*timer_leds4on.common_rule==1){
        if (timer_leds1on.ready_to_use) {
        	timer_leds1off.ready_to_use=0;
            if ((timer_leds1on.timer_is_set) && (++timer_leds1on.cur_timer_val==timer_leds1on.set_timer_limit)) {
        		timer_leds1on.cur_timer_val=0;
            	timer_leds1off.ready_to_use=1;
        		GPIO_PORTN_DATA_R |= 0x02;    // Turn on the LED.
        	}
        }
        if (timer_leds1off.ready_to_use) {
        	timer_leds1on.ready_to_use=0;
        	if ((timer_leds1off.timer_is_set) && (++timer_leds1off.cur_timer_val==timer_leds1off.set_timer_limit)) {
    			timer_leds1off.cur_timer_val=0;
    			timer_leds1on.ready_to_use=1;
    			GPIO_PORTN_DATA_R &= ~(0x02);    // Turn off the LED.
    			leds_position=2;
        	}
    	}
    }
    //.........................................................................
    if (*timer_leds1on.common_rule==2){
        if (timer_leds2on.ready_to_use) {
        	timer_leds2off.ready_to_use=0;
            if ((timer_leds2on.timer_is_set) && (++timer_leds2on.cur_timer_val==timer_leds2on.set_timer_limit)) {
        		timer_leds2on.cur_timer_val=0;
            	timer_leds2off.ready_to_use=1;
        		GPIO_PORTN_DATA_R |= 0x01;    // Turn on the LED.
        	}
        }
        if (timer_leds2off.ready_to_use) {
        	timer_leds2on.ready_to_use=0;
        	if ((timer_leds2off.timer_is_set) && (++timer_leds2off.cur_timer_val==timer_leds2off.set_timer_limit)) {
    			timer_leds2off.cur_timer_val=0;
    			timer_leds2on.ready_to_use=1;
    			GPIO_PORTN_DATA_R &= ~(0x01);    // Turn off the LED.
    			leds_position=3;
        	}
    	}
    }
    //.........................................................................
    if (*timer_leds2on.common_rule==3){
        if (timer_leds3on.ready_to_use) {
        	timer_leds3off.ready_to_use=0;
            if ((timer_leds3on.timer_is_set) && (++timer_leds3on.cur_timer_val==timer_leds3on.set_timer_limit)) {
        		timer_leds3on.cur_timer_val=0;
            	timer_leds3off.ready_to_use=1;
            	GPIO_PORTF_AHB_DATA_R |= 0x10;    // Turn on the LED.
        	}
        }
        if (timer_leds3off.ready_to_use) {
        	timer_leds3on.ready_to_use=0;
        	if ((timer_leds3off.timer_is_set) && (++timer_leds3off.cur_timer_val==timer_leds3off.set_timer_limit)) {
    			timer_leds3off.cur_timer_val=0;
    			timer_leds3on.ready_to_use=1;
    			GPIO_PORTF_AHB_DATA_R &= ~(0x10);    // Turn off the LED.
    			leds_position=4;
        	}
    	}
    }
    //.........................................................................
    if (*timer_leds3on.common_rule==4){
        if (timer_leds4on.ready_to_use) {
        	timer_leds4off.ready_to_use=0;
            if ((timer_leds4on.timer_is_set) && (++timer_leds4on.cur_timer_val==timer_leds4on.set_timer_limit)) {
        		timer_leds4on.cur_timer_val=0;
            	timer_leds4off.ready_to_use=1;
            	GPIO_PORTF_AHB_DATA_R |= 0x01;    // Turn on the LED.
        	}
        }
        if (timer_leds4off.ready_to_use) {
        	timer_leds4on.ready_to_use=0;
        	if ((timer_leds4off.timer_is_set) && (++timer_leds4off.cur_timer_val==timer_leds4off.set_timer_limit)) {
    			timer_leds4off.cur_timer_val=0;
    			timer_leds4on.ready_to_use=1;
    			GPIO_PORTF_AHB_DATA_R &= ~(0x01);    // Turn off the LED.
    			leds_position=1;
        	}
    	}
    }
    //.........................................................................
    return 0;
}

