prst/TM4C1294/blinky.c
    do { //Move to where representation ends
        ++p;
        shifter = shifter/10;
        *p = shifter;
    } while (shifter) ;

    //*p = '\0';
    *p = '.';

    do { //Move to where representation ends
        ++p;
        ostatok = ostatok/10;
        *p = ostatok;
    } while ((int)ostatok) ;

    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);

    return b;
}
//******************************************************************************



//******************************************************************************
char *ultostr(unsigned long value, char *ptr, int base)
{
  unsigned long t = 0, res = 0;
  unsigned long tmp = value;
  int count = 0;

  if (NULL == ptr) {
    return NULL;
  }

  if (tmp == 0) {
    count++;
  }

  while(tmp > 0) {
    tmp = tmp/base;
    count++;
  }

  ptr += count;
  *ptr = '\0';

  do {
    res = value - base * (t = value / base);
    if (res < 10) {
      * -- ptr = '0' + res;
    } else
    if ((res >= 10) && (res < 16)) {
        * --ptr = 'A' - 10 + res;
    }
  } while ((value = t) != 0);

  return(ptr);
}
//******************************************************************************



//******************************************************************************
char *ftostr(float value, char *p_string, int base, uint8_t *p_comma)
{
  unsigned long t=0;
  unsigned long res=0;
  unsigned long val=0;
  float         ostatok_float=0;
  uint32_t      celoe=0, ostatok_int=0;
  uint8_t       dlina_ostatka=0;

  if (NULL == p_string) {
    return NULL;
  }

  if (NULL == p_comma) {
    return NULL;
  }

  celoe = (int)value;
  ostatok_float = value - celoe;

  if (celoe<1) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma);
		p_string += 0;
  } else
  if (celoe<10) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 1;
  } else
  if (celoe<100) {
	  *p_comma=1;
		ostatok_int = (uint32_t)((ostatok_float * 1000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 2;
  } else
  if (celoe<1000) {
	  *p_comma=2;
		ostatok_int = (uint32_t)((ostatok_float * 100));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 3;
  } else
  if (celoe<10000) {
	  *p_comma=3;
		ostatok_int = (uint32_t)((ostatok_float * 10));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 4;
  } else
  if (celoe<100000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 1));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 5;
  } else
  if (celoe<1000000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 0));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 6;
  }

  val = value;

  do {  // display - Celoe
	t = val / base;
    res = val - base * t; // res = drobnaya ot value
    if (res < 10) {
      *--p_string = '0' + res;
    }
  } while ((val = t) != 0);

  if (celoe<1) { p_string += 5;  }     else
  if (celoe<10) { p_string += 4; }     else
  if (celoe<100) { p_string += 4; }    else
  if (celoe<1000) { p_string += 4; }   else
  if (celoe<10000) { p_string += 4; }  else
  if (celoe<100000) { p_string += 4; } else
  if (celoe<1000000) { p_string += 4; }

  if (*p_comma<5) { // Display - Ostatok
	  do {
	    if (dlina_ostatka>0) {
			t = ostatok_int / base;
			res = ostatok_int - base * t; // res = drobnaya ot value
			if (res < 10) {
			  *p_string-- = '0' + res;
			}
	      dlina_ostatka--;
	    }
	  } while ( (ostatok_int=t)!=0 || dlina_ostatka!=0 );
  }

  return(p_string);
}
//******************************************************************************



//******************************************************************************
void scan_keys ( t_io_values *p_io )
{
	//if ( y_pos<16) { y_pos++; } else y_pos=0;

	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_0 ) {
		if ( p_io->in<99999 )
		if ( p_io->in<1 ) p_io->in += 0.0001; else
		if ( p_io->in<10 ) p_io->in += 0.001; else
		if ( p_io->in<100 ) p_io->in += 0.01; else
		if ( p_io->in<1000 ) p_io->in += 0.1; else
		if ( p_io->in<10000 ) p_io->in +=  1;

		if ( ++p_io->x>7 ) p_io->x=0;
		srand ( p_io->x *100 );
	}
	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_1 ) {
		if ( p_io->in>0 )
		if ( p_io->in<1 ) p_io->in -= 0.0001; else
		if ( p_io->in<10 ) p_io->in -= 0.001; else
		if ( p_io->in<100 ) p_io->in -= 0.01; else
		if ( p_io->in<1000 ) p_io->in -= 0.1; else
		if ( p_io->in<10000 ) p_io->in -=  1;

		if ( ++p_io->y>15 ) p_io->y=0;
		srand ( p_io->y *100 );
	}
}
//******************************************************************************



//******************************************************************************
t_ret_code algo_Snake ( t_io_values *p_io,  t_io_Snake *p_snake ) {
/*
 * ) Set startup values (Random?)
 * )     <--------------------------------------------------------------------.
 * ) Check direction, check border limit    <-------------------------------. |
 * ) Replase last-bit into position which before head (...now it head...!)  | |
 * ) If exist Eat-bit, enlarge for length                                   | |
 * ) ...If no, do jump to ----------------------------------------------------'
 * ) random                                                                 |
 * ) if border limits is OK, direction to left/right/up/down ---------------'
 * ) ...If border is limited ->End
 * )
 */
	t_ret_code  rc = RC_FAILED;

	if ( p_io == NULL ){
		rc=RC_PTR_FAIL;
		return rc;
	}

	if ( p_snake == NULL ){
		rc=RC_PTR_FAIL;
		return rc;
	}

	rc = RC_OK;

	//static t_algo_step  algo_step;
	uint8_t      xx, yy;
	uint32_t     rnd, rnd_tmp;

	switch ( p_snake->algo_step )
	{
		case S_INIT:
			p_snake->body = p_snake->ptr_field;
			p_snake->ptr_field     = &a_field[0][0];
			p_snake->ptr_field_eat = &a_field_eat[0][0];
			p_snake->curr_x        = 0;
			p_snake->curr_y        = 0;

			// Initiate seek random number
			srand ( 100 );

