prst/TM4C1294/blinky.c
			// Clean field
			for ( xx=0; xx<8; xx++ ) {
				for ( yy=0; yy<16; yy++ ) { a_field_eat[xx][yy]=0; }
			}

			p_snake->algo_step = S_START_RANDOM;
		break;

		case S_START_RANDOM:
			// Fill field
			for ( xx=0; xx<8; xx++ ) {
				for ( yy=0; yy<16; yy++ ) {
					rnd = (int)rand(); // get random number
					p_snake->rnd = rnd;
					rnd_tmp = rnd % 20;
					a_field_eat [xx][yy] = ( rnd_tmp < 8 ) ? 1 : 0;
				}
			}

			p_snake->algo_step = S_BEGIN;
		break;

		case S_BEGIN:
			//drv_led_8x8_clear( 0, 0, 1 );
			for ( xx=0; xx<8; xx++ ) {
				for ( yy=0; yy<16; yy++ ) {
					if (1==a_field_eat [xx][yy])
					if ( _TIMER_READY == delay_timer_count('?') ) {
						//io.in += 0.0001;
						delay_timer_count(0);
						drv_led_8x8_pixel_set(xx, yy, 0); // display info
					}
				}
			}

			p_snake->algo_step = S_START_RANDOM;//S_BEGIN;
			//p_snake->algo_step = S_MOVE;
		break;

		case S_MOVE:
			p_snake->algo_step = S_EAT_YES;
		break;

		case S_EAT_YES:
			p_snake->algo_step = S_EAT_NO;
		break;

		case S_EAT_NO:
			p_snake->algo_step = S_RANDOM;
		break;

		case S_RANDOM:
			p_snake->algo_step = S_CHANGE_DIRECTION;
		break;

		case S_CHANGE_DIRECTION:
			p_snake->algo_step = S_BORDER_END;
		break;

		case S_BORDER_END:
			p_snake->algo_step = S_BORDER_END;
		break;

		default :
			p_snake->algo_step = S_BORDER_END;
		break;
	}

	return rc;
}
//******************************************************************************



//******************************************************************************
// Blinks on the leds and indicator.
//******************************************************************************
int main (void) {
    volatile uint32_t   pos;
    volatile uint32_t   cnt=0;
	char       *p_str=0;
    uint8_t     comma;
	t_io_values io;
	t_io_Snake  snake = {.algo_step=S_INIT};

    drv_sys_init_gpio ();
    drv_usr_init_led_7segments ();
    drv_usr_init_led_8x8 ();
    drv_usr_init_scheduler_and_all_timers ();

    leds_position = 1;
    io.in = 0.0001; // Set to default value

	while(1) {  // Loop forever.
		//if ( _TIMER_READY == delay_timer_count('?') ) {
		//	//io.in += 0.0001;
		//	delay_timer_count(0);
		//}

		if ( _TIMER_READY == delay_timer_leds5x8('?') ) {
			if ( pos < 5 ) {
				p_str = ftostr ( io.in, data, 10, &comma ); // value, *ptr, base, *comma_possition
				drv_led_7segments_symbol ( pos, data[pos], comma ); // display info
				drv_led_7segments_position ( pos ); // dinamic switching
				//drv_led_8x8_pixel_set ( io.x, io.y, 0 ); // display info
				if ( RC_OK != algo_Snake (&io, &snake) ) { error_forever_loop; }
				pos++;
				cnt++;
    		} else {
				pos = 0;
    		}
			delay_timer_leds5x8(0);
    	}
		drv_led_blink ();

		if (  _TIMER_READY == delay_timer_keys_usr1_2('?') ) {
			scan_keys ( &io );
			delay_timer_keys_usr1_2(0);
		}
    }
}
//******************************************************************************
